tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Matroska media files manipulation tools
brew "mkvtoolnix"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Package for scientific computing with Python
brew "numpy"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Application launcher and productivity software
cask "alfred"
# GUI app for Homebrew
cask "cakebrew"
# Client for the Dropbox cloud storage service
cask "dropbox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Open-source code editor
cask "visual-studio-code"
