tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Matroska media files manipulation tools
brew "mkvtoolnix"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Package for scientific computing with Python
brew "numpy"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Application launcher and productivity software
cask "alfred"
# GUI app for Homebrew
cask "cakebrew"
# Client for the Dropbox cloud storage service
cask "dropbox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Open-source code editor
cask "visual-studio-code"
mas "Craft", id: 1487937127
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Session", id: 1521432881
mas "WPS Office", id: 1468073139
mas "Xcode", id: 497799835
